read_verilog -Ivvp modules/arbiter/arbiter.v
hierarchy -check -top arbiter
proc;
opt;
fsm;
opt;
memory;
opt;
techmap;
opt;
write_verilog sintesis/arbiter_rtlil.v
dfflibmap -liberty libs/cmos_cells.lib;
abc -liberty libs/cmos_cells.lib;
clean
write_verilog sintesis/arbiter_sintetizado.v
